# 摩斯密码字典
MORSE_CODE_DICT = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
    'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..',
    'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
    'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..',
    '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',
    '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----',
    ', ': '--..--', '.': '.-.-.-', '?': '..--..', '/': '-..-', '-': '-....-',
    '(': '-.--.', ')': '-.--.-'
}

# 摩斯密码编码函数
def encode_morse(text):
    text = text.upper()
    return '   '.join(MORSE_CODE_DICT.get(char, '') for char in text)

def encode_main():
    text_to_encode = input("请输入要编码的文本（大写英文）: ")
    encoded_text = encode_morse(text_to_encode)
    print("摩斯密码编码后文本:", encoded_text)

if __name__ == "__main__":
    encode_main()